
&НаСервере
Процедура ПИН_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ПараметрыКорзины") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКорзины = Параметры.ПараметрыКорзины;
	Если ПараметрыКорзины.Свойство("АдресКорзиныВХранилище") И ЗначениеЗаполнено(ПараметрыКорзины.АдресКорзиныВХранилище) Тогда
		ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(ПараметрыКорзины.АдресКорзиныВХранилище);
		Объект.Материалы.Загрузить(ТаблицаДляЗагрузки);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.Материалы Цикл
		ПриИзмененииНоменклатурыТовары(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

#Область ИзменениеНоменклатуры

&НаСервере
Процедура ПриИзмененииНоменклатурыТовары(СтрокаТаблицы)
	
	// Подготовим данные для передачи на сервер
	КонтейнерОбъект = Новый Структура;
	
	КонтейнерСтрока = Новый Структура("Номенклатура, ОтражениеВУСН, Счет, СчетЗатрат, СтатьяЗатрат, НоменклатурнаяГруппа, ПодразделениеЗатрат, СпособУчетаНДС");
	ЗаполнитьЗначенияСвойств(КонтейнерСтрока, СтрокаТаблицы);
	
	ПараметрыЗаполненияСчетовУчета = НачатьЗаполнениеСчетовУчета(
		"Материалы.Номенклатура",
		Объект,
		СтрокаТаблицы,
		КонтейнерОбъект,
		КонтейнерСтрока);
		
	// Заполним
	Изменения = МатериалПриИзмененииНаСервере(КонтейнерСтрока, КонтейнерОбъект, ПараметрыЗаполненияСчетовУчета.КЗаполнению,
		РаздельныйУчетНДСНаСчете19, Объект.СчетаУчетаЗатратВТаблице);
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Изменения);
	
КонецПроцедуры

#КонецОбласти