
&НаСервере
Процедура ПИН_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ПараметрыКорзины") Тогда
		Возврат;
	КонецЕсли;
	ПараметрыКорзины = Параметры.ПараметрыКорзины;
	Если ПараметрыКорзины.Свойство("АдресКорзиныВХранилище") И ЗначениеЗаполнено(ПараметрыКорзины.АдресКорзиныВХранилище) Тогда
		ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(ПараметрыКорзины.АдресКорзиныВХранилище);
		Объект.Товары.Загрузить(ТаблицаДляЗагрузки);
	КонецЕсли;
	
	// Отработаем типовое событие изменения номенклатуры
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		ПриИзмененииНоменклатурыТовары(СтрокаТовары);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНоменклатурыТовары(СтрокаТовары)
	
	ДанныеСтрокаТаблицы = Новый Структура("Номенклатура, Количество, Цена, Сумма, СтавкаНДС, СуммаНДС, ЭтоУслуга, СуммаСкидки");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, СтрокаТовары);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка, ТипЦен, СуммаВключаетНДС,
		|ВалютаДокумента, КурсВзаиморасчетов, КратностьВзаиморасчетов, Склад, ДоговорКонтрагента,
		|ДокументБезНДС, Реализация, ПокупательНалоговыйАгентПоНДС, ВедетсяУчетНДСПоФЗ335");
	
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Реализация = Ложь;
	
	ТоварыНоменклатураПриИзмененииНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	ИсключаемыеПоля = "";
	Если СтрокаТовары.Цена <> 0 Тогда
		ИсключаемыеПоля = "Цена, Сумма, СуммаНДС";
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(СтрокаТовары, ДанныеСтрокаТаблицы,,ИсключаемыеПоля);
	СтрокаТовары.Всего = СтрокаТовары.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТовары.СуммаНДС) - СтрокаТовары.СуммаСкидки;
	
КонецПроцедуры